#### Terraform Plan: ✅
<details>
<summary>Show</summary>
```terraform
[command]/home/runner/work/_temp/26ac5f0d-ee47-4499-be7b-94c603461e86/terraform-bin plan -input=false
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/td5cou-dev/runs/run-Di7bEocThikcPMCQ

Waiting for the plan to start...

Terraform v0.14.5
Initializing plugins and modules...
random_integer.cf_origin_id: Refreshing state... [id=1]
random_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-deciding-warthog]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:534823255669:cluster/sample-cluster]
aws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:534823255669:startup-sample-billing-alert-topic]
aws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E2O3VL6FQ5BR9W]
aws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]
aws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-deciding-warthog]
aws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]
aws_budgets_budget.cost: Refreshing state... [id=534823255669:startup-sample-monthly]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0ed09b2fc9ed97b46]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:534823255669:targetgroup/sample-target-group/585d65dbccc95a42]
aws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]
aws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]
aws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]
aws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:534823255669:listener-rule/app/default/c04b963c8f1eff13/2c0dbad140f39505/b5d06e3a0321c251]
aws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20221114203817848400000002]
aws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]
aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:534823255669:service/sample-cluster/sample-service]
aws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]
aws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]
aws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]
aws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]
aws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_budgets_budget.cost will be updated in-place
  ~ resource "aws_budgets_budget" "cost" {
        id                = "534823255669:startup-sample-monthly"
        name              = "startup-sample-monthly"
      ~ time_period_start = "2022-11-01_12:00" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:ca-central-1:534823255669:service/sample-cluster/sample-service"
        name                               = "sample-service"
        tags                               = {
            "Application" = "Startup Sample"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:534823255669:task-definition/sample-app-task:16" -> (known after apply)
        # (12 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.app[0] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:534823255669:task-definition/sample-app-task:16" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "095918508201.dkr.ecr.ca-central-1.amazonaws.com/ssp:33ca49d8c5d6a6c57e374d852e5c1df1cb7c583e" -> "095918508201.dkr.ecr.ca-central-1.amazonaws.com/ssp:"
                    # (9 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "sample-app-task" -> (known after apply)
      ~ revision                 = 16 -> (known after apply)
        tags                     = {
            "Application" = "Startup Sample"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  on budget.tf line 19, in resource "aws_budgets_budget" "cost":
  19:   cost_filters = {
  20:     TagKeyValue = "user:Project$Startup Sample"
  21:   }

Use the attribute "cost_filter" instead.

(and 3 more similar warnings elsewhere)


Warning: Deprecated Resource

  on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":
  31: data "aws_subnet_ids" "web" {

The aws_subnet_ids data source has been deprecated and will be removed in a
future version. Use the aws_subnets data source instead.

(and 2 more similar warnings elsewhere)


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.16160000000000048/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/td5cou-dev/runs/run-Di7bEocThikcPMCQ%0A%0AWaiting for the plan to start...%0A%0ATerraform v0.14.5%0AInitializing plugins and modules...%0Arandom_integer.cf_origin_id: Refreshing state... [id=1]%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-deciding-warthog]%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:534823255669:cluster/sample-cluster]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:534823255669:startup-sample-billing-alert-topic]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E2O3VL6FQ5BR9W]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-deciding-warthog]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=534823255669:startup-sample-monthly]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0ed09b2fc9ed97b46]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:534823255669:targetgroup/sample-target-group/585d65dbccc95a42]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:534823255669:listener-rule/app/default/c04b963c8f1eff13/2c0dbad140f39505/b5d06e3a0321c251]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20221114203817848400000002]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:534823255669:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "534823255669:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2022-11-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A      ~ desired_count                      = 1 -> 2%0A        id                                 = "arn:aws:ecs:ca-central-1:534823255669:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:534823255669:task-definition/sample-app-task:16" -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:534823255669:task-definition/sample-app-task:16" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                  ~ image            = "095918508201.dkr.ecr.ca-central-1.amazonaws.com/ssp:33ca49d8c5d6a6c57e374d852e5c1df1cb7c583e" -> "095918508201.dkr.ecr.ca-central-1.amazonaws.com/ssp:"%0A                    # (9 unchanged elements hidden)%0A                } # forces replacement,%0A            ]%0A        )%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A      ~ revision                 = 16 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A%0AWarning: Argument is deprecated%0A%0A  on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A  19:   cost_filters = {%0A  20:     TagKeyValue = "user:Project$Startup Sample"%0A  21:   }%0A%0AUse the attribute "cost_filter" instead.%0A%0A(and 3 more similar warnings elsewhere)%0A%0A%0AWarning: Deprecated Resource%0A%0A  on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A  31: data "aws_subnet_ids" "web" {%0A%0AThe aws_subnet_ids data source has been deprecated and will be removed in a%0Afuture version. Use the aws_subnets data source instead.%0A%0A(and 2 more similar warnings elsewhere)%0A%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.16160000000000048/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/td5cou-dev/runs/run-Di7bEocThikcPMCQ%0A%0AWaiting for the plan to start...%0A%0ATerraform v0.14.5%0AInitializing plugins and modules...%0Arandom_integer.cf_origin_id: Refreshing state... [id=1]%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-deciding-warthog]%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:534823255669:cluster/sample-cluster]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:534823255669:startup-sample-billing-alert-topic]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E2O3VL6FQ5BR9W]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-deciding-warthog]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=534823255669:startup-sample-monthly]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0ed09b2fc9ed97b46]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:534823255669:targetgroup/sample-target-group/585d65dbccc95a42]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:534823255669:listener-rule/app/default/c04b963c8f1eff13/2c0dbad140f39505/b5d06e3a0321c251]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20221114203817848400000002]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:534823255669:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "534823255669:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2022-11-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A      ~ desired_count                      = 1 -> 2%0A        id                                 = "arn:aws:ecs:ca-central-1:534823255669:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:534823255669:task-definition/sample-app-task:16" -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:534823255669:task-definition/sample-app-task:16" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                  ~ image            = "095918508201.dkr.ecr.ca-central-1.amazonaws.com/ssp:33ca49d8c5d6a6c57e374d852e5c1df1cb7c583e" -> "095918508201.dkr.ecr.ca-central-1.amazonaws.com/ssp:"%0A                    # (9 unchanged elements hidden)%0A                } # forces replacement,%0A            ]%0A        )%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A      ~ revision                 = 16 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A%0AWarning: Argument is deprecated%0A%0A  on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A  19:   cost_filters = {%0A  20:     TagKeyValue = "user:Project$Startup Sample"%0A  21:   }%0A%0AUse the attribute "cost_filter" instead.%0A%0A(and 3 more similar warnings elsewhere)%0A%0A%0AWarning: Deprecated Resource%0A%0A  on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A  31: data "aws_subnet_ids" "web" {%0A%0AThe aws_subnet_ids data source has been deprecated and will be removed in a%0Afuture version. Use the aws_subnets data source instead.%0A%0A(and 2 more similar warnings elsewhere)%0A%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.16160000000000048/mo +$0.0%0A

::set-output name=stderr::

::set-output name=exitcode::0

```
</details>
#### Architecture Diagram

![img](null)
*Pusher:* @crochcunill, *Action:* [Pull Request: #6](https://github.com/crochcunill/startup-sample-project-aws-containers/actions/runs/3465329319)